---
kind: type
id: T:Autodesk.Revit.DB.TextNoteLeaderTypes
source: html/79bbfd8e-1226-602b-0355-3a20c6ef3d89.htm
---
# Autodesk.Revit.DB.TextNoteLeaderTypes

Types of text-note leaders

## Syntax (C#)
```csharp
public enum TextNoteLeaderTypes
```